
var a = + prompt('Введите число "a":');//4. Присвоить переменной а значение в промежутке [0..15]. можем задать любое значение для выполнения различных условий.
var	b = + prompt('Введите число "b":');//можем задать любое значение для выполнения различных условий.


	if (a >= 0 && b >= 0) {
		console.log ('Разница переменных "a" и "b" равна: ' + (a - b));//если a и b положительные, вывести их разность;
	} else if (a < 0 && b < 0){
		console.log ('Произведение переменных "a" и "b" равна: ' + (a * b));//если а и b отрицательные, вывести их произведение;
	} else if (a * b <= 0) {
		console.log ('Сумма переменных "a" и "b" равна: ' + (a + b));//если а и b разных знаков, вывести их сумму; ноль можно считать положительным числом.
	} else {
		console.log ('Введенные символы не соответствуют ни одному условию, или  Вы ввели не цифры!!!');
	}


	switch (a) {
		case 1:
			a++
			console.log ('Значение перменной  = ' + a );
		case 2:
			a++
			console.log ('Значение перменной  = ' + a );
		case 3:
			a++
			console.log ('Значение перменной  = ' + a );
		case 4:
			a++
			console.log ('Значение перменной  = ' + a );
		case 5:
			a++
			console.log ('Значение перменной  = ' + a );
		case 6:
			a++
			console.log ('Значение перменной  = ' + a );
		case 7:
			a++
			console.log ('Значение перменной  = ' + a );
		case 8:
			a++
			console.log ('Значение перменной  = ' + a );
		case 9:
			a++
			console.log ('Значение перменной  = ' + a );
		case 10:
			a++
			console.log ('Значение перменной  = ' + a );
		case 11:
			a++
			console.log ('Значение перменной  = ' + a );
		case 12:
			a++
			console.log ('Значение перменной  = ' + a );
		case 13:
			a++
			console.log ('Значение перменной  = ' + a );
		case 14: 
			a++
		case 15:
			console.log ('Значение перменной достигнуто = ' + a );
			break;
		default:
			console.log ('Введенное значение превышает 15');
			break;
	}